Table of Contents
 Class Beam
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representation of 1D member in IDEA StatiCa Detail
public class Beam : Element1D, IGeometryPart
Inheritance
object
OpenObject
OpenElementId
Element1D
Beam
Implements
IGeometryPart
Inherited Members
 Element1D.Name
 Element1D.CrossSectionBegin
 Element1D.CrossSectionEnd
 Element1D.Segment
 Element1D.RotationRx
 Element1D.EccentricityBeginX
 Element1D.EccentricityBeginY
 Element1D.EccentricityBeginZ
 Element1D.EccentricityEndX
 Element1D.EccentricityEndY
 Element1D.EccentricityEndZ
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Beam()
Constructor
public Beam()
Properties
 Edges
Lines of Element2D including edges, which are created by opening
public List<ReferenceElement> Edges { get; set; }
Property Value
List<ReferenceElement>
 GeomId
Id representing geometrical parts of Detail
public int GeomId { get; set; }
Property Value
int
 InsertPoint
Insert point 0 - 9
public int InsertPoint { get; set; }
Property Value
int
 MasterComponent
Master component
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterPoint
Master point 0 - 9
public int MasterPoint { get; set; }
Property Value
int
 Position
Offset between MasterPoint and InsertPoint If MasterPoint is null, position is from origin of coordinate system
public Vector3D Position { get; set; }
Property Value
Vector3D
 Edit this page